app/Controllers/ClientController.php

SELECT *
FROM `configuration`
WHERE `id_type_operation` = '3'
AND `min` <= '30'
AND `max` >= '30'
 LIMIT 1
---
    public function getFrais()
    {
        $id_type_operation = $this->request->getGet('id_type_operation');
        $montant = $this->request->getGet('montant');

        if ($id_type_operation === null || $montant === null || $montant === '') {
            return $this->response->setJSON(['found' => false]);
        }

        $configurationModel = new ConfigurationModel();

        $configuration = $configurationModel
            ->where('id_type_operation', $id_type_operation)
            ->where('min <=', $montant)
            ->where('max >=', $montant)
            ->first();