app/Controllers/ConfigurationController.php

    public function liste()
    {
        $data['configurations'] = $this->configurationModel->findAll();
---
SELECT *
FROM `configuration`