app/Controllers/LoginController.php

SELECT *
FROM `prefixe`
---
    private function findPrefixeForNumero($numero)
    {
        $prefixes = $this->prefixeModel->findAll();