app/Controllers/OperateurController.php

SELECT *
FROM `type_operation`
---
    public function getSituationGain()
    {
        $typeOperationModel = new TypeOperationModel();

        // Récupération de la date envoyée par POST
        $date = $this->request->getPost('date');

        // Si aucune date n'est envoyée, prendre la date actuelle
        if (!$date) {
            $date = date('Y-m-d H:i:s');
        }

        // Gain total et nombre total d'opérations
        $total = $typeOperationModel->getGainTotal($date,false);


        // Gains par type d'opération
        $types = $typeOperationModel->findAll();

SELECT *
FROM `type_operation`
---
        public function getSituationGainAutreOperateur()
    {
        $typeOperationModel = new TypeOperationModel();

        // Récupération de la date envoyée par POST
        $date = $this->request->getPost('date');

        // Si aucune date n'est envoyée, prendre la date actuelle
        if (!$date) {
            $date = date('Y-m-d H:i:s');
        }

        // Gain total et nombre total d'opérations
        $total = $typeOperationModel->getGainTotal($date,true);


        // Gains par type d'opération
        $types = $typeOperationModel->findAll();

SELECT *
FROM `operateur`
---
    public function listeOperateurs() {

        $operateurs = $this->operateurModel->findAll();

SELECT *
FROM `operateur`
WHERE `operateur`.`id` = '3'
---
    public function situationAutreOperateur($id_operateur)
    {
        // montant total des gains pour l'opérateur spécifié
        $totalGains = $this->historiqueModel->getTotalGainsByOperateur($id_operateur);
        $operateur = $this->operateurModel->find($id_operateur);