app/Controllers/PrefixeController.php

SELECT `prefixe`.*, `operateur`.`nom` AS `operateur_nom`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`operateur_id`
---
    public function liste()
    {
        $data['prefixes'] = $this->prefixeModel
            ->select('prefixe.*, operateur.nom AS operateur_nom')
            ->join('operateur', 'operateur.id = prefixe.operateur_id')
            ->findAll();