app/Controllers/TypeOperationController.php

    public function liste()
    {
        $data['typeOperations'] = $this->typeOperationModel->findAll();
---
SELECT *
FROM `type_operation`