app/Models/ClientModel.php

    public function getClientByNumero($numero)
    {
        return $this->where('numero', $numero)->first();
---
SELECT *
FROM `client`
WHERE `numero` = '0341234501'
 LIMIT 1

    public function getClientById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `client`
WHERE `client`.`id` = 2

    public function getHistoriqueClient($id)
    {
        return $this->db->table('historique')
            ->select('
                historique.id,
                historique.montant,
                historique.frais,
                historique.date,
                type_operation.libelle AS type_operation
            ')
            ->join(
                'type_operation',
                'type_operation.id = historique.id_type_operation'
            )
            ->where('historique.id_client', $id)
            ->orderBy('historique.date', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `historique`.`id`, `historique`.`montant`, `historique`.`frais`, `historique`.`date`, `type_operation`.`libelle` AS `type_operation`
FROM `historique`
JOIN `type_operation` ON `type_operation`.`id` = `historique`.`id_type_operation`
WHERE `historique`.`id_client` = 1
ORDER BY `historique`.`date` DESC

    public function FirstClient()
    {
        return $this->orderBy('id', 'ASC')->first();
---
SELECT *
FROM `client`
ORDER BY `id` ASC
 LIMIT 1