app/Models/ClientModel.php

    public function getClientById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `client`
WHERE `client`.`id` = '1'