app/Models/HistoriqueModel.php

SELECT COUNT(*) AS nombre, SUM(h.commission) AS total_gains
FROM `historique` `h`
JOIN `client` `c` ON `c`.`id` = `h`.`id_destinataire`
WHERE `c`.`operateur_id` = '3'
---
public function getTotalGainsByOperateur($id_operateur)
{
    return $this->db->table('historique h')
        ->select('COUNT(*) AS nombre, SUM(h.commission) AS total_gains')
        ->join('client c', 'c.id = h.id_destinataire')
        ->where('c.operateur_id', $id_operateur)
        ->get()
        ->getRowArray();