app/Models/OperateurModel.php

    public function CheckOperateur($nom, $mdp)
    {
        return $this->where('nom', $nom)->where('mdp', $mdp)->first();
---
SELECT *
FROM `operateur`
WHERE `nom` = 'jean'
AND `mdp` = '1234'
 LIMIT 1

    public function FirstOperateur()
    {
        return $this->orderBy('id', 'ASC')->first();
---
SELECT *
FROM `operateur`
ORDER BY `id` ASC
 LIMIT 1