app/Models/TypeOperationModel.php

SELECT COUNT(*) AS nombre, SUM(h.frais) AS gain
FROM `historique` `h`
JOIN `client` `c` ON `c`.`id` = `h`.`id_client`
WHERE `h`.`id_type_operation` = 1
AND `c`.`operateur_id` != 1
AND `h`.`date` <= '2026-07-20 16:23:06'
SELECT COUNT(*) AS nombre, SUM(h.frais) AS gain
FROM `historique` `h`
JOIN `client` `c` ON `c`.`id` = `h`.`id_client`
WHERE `h`.`id_type_operation` = 1
AND `c`.`operateur_id` = 1
AND `h`.`date` <= '2026-07-20 14:23:38'
---
public function getGainParType($id_type_operation, $date, $isAutreOperateur)
{
    if ($isAutreOperateur) {
        return $this->db->table('historique h')
            ->select('COUNT(*) AS nombre, SUM(h.frais) AS gain')
            ->join('client c', 'c.id = h.id_client')
            ->where('h.id_type_operation', $id_type_operation)
            ->where('c.operateur_id !=', 1)
            ->where('h.date <=', $date)
            ->get()
            ->getRowArray();
    } else {
        return $this->db->table('historique h')
        ->select('COUNT(*) AS nombre, SUM(h.frais) AS gain')
        ->join('client c', 'c.id = h.id_client')
        ->where('h.id_type_operation', $id_type_operation)
        ->where('c.operateur_id', 1)
        ->where('h.date <=', $date)
        ->get()
        ->getRowArray();

SELECT *
FROM `type_operation`
---
    public function getGainTotal($date,$isAutreOperateur)
    {
        $types = $this->findAll();