app/Models/TypeOperationModel.php

SELECT COUNT(*) AS nombre, SUM(frais) AS gain
FROM `historique`
WHERE `id_type_operation` = 1
AND `date` <= '2026-07-20 10:34:46'
---
    public function getGainParType($id_type_operation, $date)
    {
        return $this->db->table('historique')
            ->select('COUNT(*) AS nombre, SUM(frais) AS gain')
            ->where('id_type_operation', $id_type_operation)
            ->where('date <=', $date)
            ->get()
            ->getRowArray();